Revit 2027 API
ParameterTypeId.FabricationServiceAbbreviation Property
 "Fabrication Service Abbreviation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationServiceAbbreviation { get; }
Public Shared ReadOnly Property FabricationServiceAbbreviation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationServiceAbbreviation {
	ForgeTypeId^ get ();
}
static member FabricationServiceAbbreviation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace